Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91176.atdf
        <register name="SMC_CYCLE" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00030003" caption="SMC Cycle Register">
          <bitfield name="NWE_CYCLE" caption="Total Write Cycle Length" mask="0x1FF"/>
          <bitfield name="NRD_CYCLE" caption="Total Read Cycle Length" mask="0x1FF0000"/>
        </register>
        <register name="SMC_MODE" offset="0xC" rw="RW" size="4" access-size="4" initval="0x10001003" caption="SMC Mode Register">
          <bitfield name="READ_MODE" caption="Read Mode" mask="0x1"/>
          <bitfield name="WRITE_MODE" caption="Write Mode" mask="0x2"/>
          <bitfield name="EXNW_MODE" caption="NWAIT Mode" mask="0x30" values="SMC_MODE__EXNW_MODE"/>
          <bitfield name="BAT" caption="Byte Access Type" mask="0x100" values="SMC_MODE__BAT"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x1000" values="SMC_MODE__DBW"/>
          <bitfield name="TDF_CYCLES" caption="Data Float Time" mask="0xF0000"/>
          <bitfield name="TDF_MODE" caption="TDF Optimization" mask="0x100000"/>
          <bitfield name="PMEN" caption="Page Mode Enabled" mask="0x1000000"/>
          <bitfield name="PS" caption="Page Size" mask="0x30000000" values="SMC_MODE__PS"/>
        </register>
      </register-group>
      <register-group name="EBI" caption="External Bus Interface">
        <register-group name="CS_X" name-in-module="CS_X" offset="0x00" size="0x10" count="4"/>
        <register name="SMC_WPMR" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SMC Write Protection Mode Register">
          <bitfield name="WPEN" caption="Write Protect Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="SMC_WPMR__WPKEY"/>
        </register>
        <register name="SMC_WPSR" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="SMC Write Protection Status Register">
          <bitfield name="WPVS" caption="Write Protection Violation Status" mask="0x1"/>
          <bitfield name="WPVSRC" caption="Write Protection Violation Source" mask="0xFFFF00"/>
        </register>
      </register-group>
      <value-group caption="" name="SMC_MODE__EXNW_MODE">
        <value caption="Disabled-The NWAIT input signal is ignored on the corresponding chip select." name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." name="FROZEN" value="0x2"/>
        <value caption="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE__BAT">
        <value caption="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." name="BYTE_SELECT" value="0"/>
        <value caption="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." name="BYTE_WRITE" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE__DBW">
        <value caption="8-bit Data Bus" name="_8_BIT" value="0"/>
        <value caption="16-bit Data Bus" name="_16_BIT" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534D43"/>
      </value-group>
    </module>
    <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10" values="EIC_NMICTRL__NMIASYNCH"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF"/>
        </register>
