Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91176.atdf
        <register modes="ENDPOINTX" name="TXCSRH" offset="0x1013" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15">
          <mode name="HOST_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP1-15 In Host Mode"/>
          <mode name="PERIPHERAL_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP1-15 In Peripheral Mode"/>
          <bitfield modes="HOST_EPX" name="DATATOGGLE" caption="When Read, This Bit Indicates The Current State Of The Endpoint" mask="0x1"/>
          <bitfield modes="HOST_EPX" name="DATATOGGLEWRENABLE" caption="The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written" mask="0x2"/>
          <bitfield modes="HOST_EPX" name="DMAREQMODE" caption="The CPU Sets This Bit To Select DMA Request Mode" mask="0x4"/>
          <bitfield modes="PERIPHERAL_EPX" name="DMAREQMODE" caption="The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0." mask="0x4"/>
          <bitfield modes="HOST_EPX" name="FRCDATATOG" caption="The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe" mask="0x8"/>
          <bitfield modes="PERIPHERAL_EPX" name="FRCDATATOG" caption="The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO." mask="0x8"/>
          <bitfield modes="HOST_EPX" name="DMAREQENAB" caption="The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint" mask="0x10"/>
          <bitfield modes="PERIPHERAL_EPX" name="DMAREQENAB" caption="The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint" mask="0x10"/>
          <bitfield name="MODE" caption="The CPU Sets This Bit To Enable The Endpoint Direction As TX" mask="0x20"/>
          <bitfield modes="PERIPHERAL_EPX" name="ISO" caption="The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers" mask="0x40"/>
          <bitfield modes="HOST_EPX" name="AUTOSET" caption="If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P" mask="0x80"/>
          <bitfield modes="PERIPHERAL_EPX" name="AUTOSET" caption="If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO." mask="0x80"/>
        </register>
        <register modes="ENDPOINT0" name="CSR0H" offset="0x1013" rw="RW" size="1" initval="0x00" caption="ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0">
          <mode name="HOST_EP0" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP0 In Host Mode"/>
          <mode name="PERIPHERAL_EP0" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP0 In Peripheral Mode"/>
          <bitfield name="FLUSHFIFO" caption="Flush The Next Packet To Be Transmitted/Read" mask="0x1"/>
          <bitfield modes="HOST_EP0" name="DATATOGGLE" caption="When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle" mask="0x2"/>
          <bitfield modes="HOST_EP0" name="DATATOGGLEWRTENABLE" caption="The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written" mask="0x4"/>
          <bitfield modes="HOST_EP0" name="DISPING" caption="The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer" mask="0x8"/>
        </register>
        <register modes="ENDPOINTX" name="RXMAXP" offset="0x1014" rw="RW" size="2" initval="0x0000" caption="ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation">
          <bitfield name="MAXPAYLOAD" caption="Maximum Payload/Transactions" mask="0x7FF"/>
          <bitfield name="MULTIPLIER" caption="Multiplier Value (m-1)" mask="0xF800"/>
        </register>
        <register modes="ENDPOINTX" name="RXCSRL" offset="0x1016" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15">
          <mode name="HOST_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP1-15 In Host Mode"/>
          <mode name="PERIPHERAL_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP1-15 In Peripheral Mode"/>
          <bitfield name="RXPKTRDY" caption="This Bit Is Set When A Data Packet Has Been Received." mask="0x1"/>
          <bitfield modes="HOST_EPX" name="FIFOFULL" caption="This Bit Is Set When No More Packets Can Be Loaded" mask="0x2"/>
          <bitfield modes="PERIPHERAL_EPX" name="FIFOFULL" caption="This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO." mask="0x2"/>
          <bitfield modes="HOST_EPX" name="ERROR" caption="The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received." mask="0x4"/>
          <bitfield modes="PERIPHERAL_EPX" name="OVERRUN" caption="This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO." mask="0x4"/>
          <bitfield modes="PERIPHERAL_EPX" name="DATAERROR" caption="This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error." mask="0x8"/>
          <bitfield modes="HOST_EPX" name="NAKTIMEOUT" caption="This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error." mask="0x8"/>
          <bitfield name="FLUSHFIFO" caption="The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO" mask="0x10"/>
          <bitfield modes="HOST_EPX" name="REQPKT" caption="The CPU Writes A 1 To This Bit To Request An IN Transaction." mask="0x20"/>
          <bitfield modes="PERIPHERAL_EPX" name="SENDSTALL" caption="The CPU Writes A 1 To This Bit To Issue A STALL Handshake." mask="0x20"/>
          <bitfield modes="HOST_EPX" name="RXSTALL" caption="When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated." mask="0x40"/>
          <bitfield modes="PERIPHERAL_EPX" name="SENTSTALL" caption="This Bit Is Set When A STALL Handshake Is Transmitted." mask="0x40"/>
          <bitfield name="CLRDATATOG" caption="The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0." mask="0x80"/>
        </register>
        <register modes="ENDPOINTX" name="RXCSRH" offset="0x1017" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15">
          <mode name="HOST_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP1-15 In Host Mode"/>
          <mode name="PERIPHERAL_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP1-15 In Peripheral Mode"/>
          <bitfield modes="HOST_EPX" name="INCOMPRX" caption="This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete" mask="0x1"/>
          <bitfield modes="PERIPHERAL_EPX" name="INCOMPRX" caption="This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received." mask="0x1"/>
          <bitfield modes="HOST_EPX" name="DATATOGGLE" caption="When Read, This Bit Indicates The Current State Of The Endpoint" mask="0x2"/>
          <bitfield modes="HOST_EPX" name="DATATOGGLEWRTENABLE" caption="The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written" mask="0x4"/>
          <bitfield name="DMAREQMODE" caption="The CPU Sets This Bit To Select DMA Request Mode" mask="0x8"/>
          <bitfield modes="PERIPHERAL_EPX" name="DISNYET" caption="The CPU Sets This Bit To Disable The Sending Of NYET Handshakes" mask="0x10"/>
          <bitfield modes="HOST_EPX" name="PIDERROR" caption="Indicates A PID Error In The Received Packet" mask="0x10"/>
          <bitfield name="DMAREQENAB" caption="The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint" mask="0x20"/>
          <bitfield modes="HOST_EPX" name="AUTOREQ" caption="If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared." mask="0x40"/>
          <bitfield modes="PERIPHERAL_EPX" name="ISO" caption="The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers" mask="0x40"/>
          <bitfield modes="PERIPHERAL_EPX" name="AUTOCLEAR" caption="If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO" mask="0x80"/>
          <bitfield modes="HOST_EPX" name="AUTOCLEAR" caption="If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO" mask="0x80"/>
        </register>
        <register modes="ENDPOINTX" name="RXCOUNT" offset="0x1018" rw="R" size="2" initval="0x0000" caption="ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO.">
          <bitfield name="ENDPOINTRXCOUNT" caption="Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO." mask="0x3FFF"/>
        </register>
        <register modes="ENDPOINT0" name="COUNT0" offset="0x1018" rw="R" size="1" initval="0x00" caption="ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO">
          <bitfield name="EP0RXCOUNT" caption="Number Of Received Data Bytes In Endpoint 0 FIFO" mask="0x7F"/>
        </register>
        <register modes="ENDPOINTX" name="TXTYPE" offset="0x101A" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint">
          <bitfield name="ENDPOINTNUMBER" caption="the cpu should set this value to the endpoint number contained in the tx endpoint descriptor" mask="0xF"/>
          <bitfield name="PROTOCOL" caption="the cpu should set this to select the required protocol for the tx endpoint 00: control 01: isochronous 10: bulk 11: interrupt" mask="0x30" values="ENDPOINTX_TXTYPE__PROTOCOL"/>
          <bitfield name="SPEED" caption="operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low" mask="0xC0" values="ENDPOINTX_TXTYPE__SPEED"/>
        </register>
